# IsTemplate Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
View..::..IsTemplate Property
View Class See Also
---
Test whether the view is a view template.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2011
# Syntax
C#
---
```text
public bool IsTemplate { get; }
```

Visual Basic
---
```text
Public ReadOnly Property IsTemplate As Boolean
	Get
```

Visual C++
---
```text
public:
property bool IsTemplate {
	bool get ();
}
```

# See Also
View Class
Autodesk.Revit.DB Namespace